title: Suspicious SilentProcessExit Registry Modification
id: dd05e4a8-0de0-454d-8366-755197d36e82
status: test
description: Detects modifications to the SilentProcessExit registry key, which can be leveraged by attackers to configure an executable to run automatically when a specified process exits.
references:
    - https://www.darkrelay.com/post/ifeo-injection
    - https://www.atomicredteam.io/atomic-red-team/atomics/T1546.012#atomic-test-2---ifeo-global-flags
author: lazarg
date: 2025-04-20
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1546.012
logsource:
    category: process_creation
    product: windows
detection:
    selection_cmd_reg:
        Image|endswith: '\reg.exe'
        CommandLine|contains: 'add'
    selection_cmd_powershell:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        CommandLine|contains:
            - 'Set-ItemProperty'
            - 'sp'
    selection_keys:
        CommandLine|contains|all: 
            - 'SilentProcessExit'
            - 'MonitorProcess'
    condition: 1 of selection_cmd_* and selection_keys
falsepositives:
    - Unlikely
level: high