title: Disable Windows Firewall via Registry Modification
id: dcb969e9-d5a1-4c1e-9916-1e61a0e8fda3
status: experimental
description: |
  Detects modification of the EnableFirewall registry key to disable the Windows Firewall,
  which may be indicative of malicious activity attempting to reduce host defenses.
references:
  - https://attack.mitre.org/techniques/T1562/004/
author: lazarg
date: 2025-07-01
tags:
  - attack.defense_evasion
  - attack.t1562.004
logsource:
  product: windows
  category: registry_event
detection:
  selection:
    EventType: SetValue
    TargetObject|endswith: '\SYSTEM\CurrentControlSet\Services\SharedAccess\Parameters\FirewallPolicy\PublicProfile\EnableFirewall'
    Details: 'DWORD (0x00000000)'
  condition: selection
falsepositives:
  - Unknown
level: medium
