title: UACBypass Present in ScriptBlockText
id: a91b5cf2-117a-4d6b-bcfa-50b53bde7c3e
status: experimental
description: |
  Detects PowerShell script blocks containing the keyword 'UACBypass',
  which may indicate the use of privilege escalation techniques such as those found in offensive security tools like WinPwn.
references:
  - https://attack.mitre.org/techniques/T1548/002/
  - https://github.com/S3cur3Th1sSh1t/WinPwn
author: lazarg
date: 2025-07-01
tags:
  - attack.privilege_escalation
  - attack.t1548.002
logsource:
  product: windows
  service: powershell
  category: scriptblocklog
detection:
  selection:
    ScriptBlockText|contains: 'UACBypass'
  condition: selection
falsepositives:
  - Unlikely
level: high
