title: Ransom Note File Creation - YOUR_FILES.txt
id: 9c1b7c76-1f65-4e0e-9135-1b048a847fdd
status: experimental
description: |
  Detects the creation of a file named "YOUR_FILES.txt", which is a known indicator of ransomware activity.
  Many ransomware families drop this file as a ransom note after encrypting victim files.
author: lazarg
date: 2025-07-01
tags:
  - attack.impact
  - attack.t1486
logsource:
  product: windows
  category: file_creation
detection:
  selection:
    TargetFilename|endswith: '\YOUR_FILES.txt'
  condition: selection
falsepositives:
  - Unlikely
level: high
