title: AnyDesk Execution
id: b52e84a3-029e-4529-b09b-71d19dd27e94
status: test
description: |
  Detects the execution of AnyDesk remote access software based on PE metadata fields such as OriginalFileName and Product name.
  Useful for cases where the binary has been renamed to evade signature-based detection.
author: lazarg
date: 2025-07-01
tags:
    - attack.command-and-control
    - attack.t1219.002
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\AnyDesk.exe'
        - Description: AnyDesk
        - Product: AnyDesk
        - Company: AnyDesk Software GmbH
    condition: selection
falsepositives:
    - Legitimate AnyDesk usage by IT/admins
level: low
