title: WinRAR Data Compression With Password Flag
id: 24d17b0f-b0d8-4a38-8992-4fc7e0c1f7d7
status: experimental
description: Detects WinRAR being used to compress files with a password flag (-p), which may indicate attempts to obfuscate data prior to exfiltration.
author: lazarg
date: 2025-07-01
tags:
  - attack.defense_evasion
  - attack.t1560.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\winrar.exe'
      - '\rar.exe'
    CommandLine|contains:
      - ' a '
      - ' -p'
  condition: all of selection
falsepositives:
  - Unknown
level: low
